<a href="https://colab.research.google.com/github/makaronaaa/NLP/blob/main/salaries_panda.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# 1. load the dataset csv file using Pandas
import pandas as pd
import csv
import numpy
df=pd.read_csv("/content/sample_data/ds_salaries.csv")
print(df)

     Unnamed: 0  work_year experience_level employment_type  \
0             0       2020               MI              FT
1             1       2020               SE              FT
2             2       2020               SE              FT
3             3       2020               MI              FT
4             4       2020               SE              FT
..          ...        ...              ...             ...
602         602       2022               SE              FT
603         603       2022               SE              FT
604         604       2022               SE              FT
605         605       2022               SE              FT
606         606       2022               MI              FT

                      job_title  salary salary_currency  salary_in_usd  \
0                Data Scientist   70000             EUR          79833
1    Machine Learning Scientist  260000             USD         260000
2             Big Data Engineer   85000             GBP         109024
3          Product Data Analyst   20000             USD          20000
4     Machine Learning Engineer  150000             USD         150000
..                          ...     ...             ...            ...
602               Data Engineer  154000             USD         154000
603               Data Engineer  126000             USD         126000
604                Data Analyst  129000             USD         129000
605                Data Analyst  150000             USD         150000
606                AI Scientist  200000             USD         200000

    employee_residence  remote_ratio company_location company_size
0                   DE             0               DE            L
1                   JP             0               JP            S
2                   GB            50               GB            M
3                   HN             0               HN            S
4                   US            50               US            L
..                 ...           ...              ...          ...
602                 US           100               US            M
603                 US           100               US            M
604                 US             0               US            M
605                 US           100               US            M
606                 IN           100               US            L

[607 rows x 12 columns]

In [4]:
#compute average salary by year?
df=pd.read_csv("/content/sample_data/ds_salaries.csv")
df1 = df[['salary','work_year']]
avg = df1.groupby('work_year').mean()
print("average salary by yearis = ", avg)

average salary by yearis =                    salary
work_year
2020       382386.236111
2021       546677.387097
2022       158827.786164

In [9]:
#which year was the lowest and which year was the highest?
# salary= df["salary"]
# highest = salary.max()
# lowest = salary.min()
# print(highest)
# print(lowest)

df1 = df[['salary','work_year']]
highest1 = df1.max()
lowest1 = df1.min()
print(highest1)
print(lowest1)

salary       30400000
work_year        2022
dtype: int64
salary       4000
work_year    2020
dtype: int64

In [22]:
#for each experience level, compute the average salary (over 3 years) for each job title?
df2 = df[['experience_level','salary','job_title']]
#print(df2)
avg = df2.groupby(['job_title', 'experience_level']).mean()
print(avg)

                                                       salary
job_title                     experience_level
3D Computer Vision Researcher MI                400000.000000
AI Scientist                  EN                414750.000000
                              MI                160000.000000
                              SE                 55000.000000
Analytics Engineer            EX                155000.000000
...                                                       ...
Product Data Analyst          MI                235000.000000
Research Scientist            EN                 80500.000000
                              MI                142142.714286
                              SE                 90180.000000
Staff Data Scientist          SE                105000.000000

[105 rows x 1 columns]

In [24]:
#For which job title was it the minimum and maximum?
df2 = df[['salary','job_title']]
max = df2.max()
min = df2.min()
print(max)
print(min)

salary                   30400000
job_title    Staff Data Scientist
dtype: object
salary                                4000
job_title    3D Computer Vision Researcher
dtype: object

In [28]:
#for each year and job title compute the annual salary?
df3 = df[['salary','work_year']]
sum = df3.groupby(['work_year']).sum()
print(sum)

              salary
work_year
2020        27531809
2021       118628993
2022        50507236

In [98]:
#which job title experienced the maximum change in salary?
#Which job title had the minimum change.

df2 = df[['salary','job_title']]
#print(df2)
min = df2.groupby(['job_title']).min()
#print(min)
max = df2.groupby(['job_title']).max()
#print(max)
df4 = df2.groupby(['job_title']).max()- df2.groupby(['job_title']).min()
#print(df4)
# 'diff = df2.groupby(['job_title']).diff()'
#print(diff)
max = df4.max()
print(max)

min = df4.min()
print(min)

salary    30396000
dtype: int64
salary    0
dtype: int64

In [102]:
#compute the average salaries for each remote ratio?
#how many entries are there?

df5 = df[['remote_ratio','salary',]]
#print(df2)
avg_ratio = df5.groupby(['remote_ratio']).mean()
print(avg_ratio)
entries=avg_ratio.count()
print('# of entries there =', entries)

                     salary
remote_ratio
0             218147.842520
50            708018.171717
100           259499.902887
# of entries there = salary    3
dtype: int64